In [1]:
import pandas as pd
import numpy as np

In [2]:
my_array = np.ones(3, dtype=([('foo', int), ('bar', float)]))
print(my_array['foo'])

[1 1 1]

In [4]:
my_array2 = my_array.view(np.recarray)
print(my_array2)

[(1, 1.) (1, 1.) (1, 1.)]

In [6]:
data = np.array([['', 'Col1', 'Col2'],
                 ['Row1', 1, 2],
                 ['Row2', 3, 4]
])

df = pd.DataFrame(data=data[1:,1:],
                  index=data[1:,0],
                  columns=data[0,1:]
)

df

     Col1 Col2
Row1    1    2
Row2    3    4

In [7]:
my_2darray = np.array([[1, 2, 3], [4, 5, 6]])
pd.DataFrame(my_2darray)

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
my_dict = {1: ['1', '3'], 2: ['1', '2'], 3: ['2', '4']}
print(pd.DataFrame(my_dict))

   1  2  3
0  1  1  2
1  3  2  4

In [9]:
my_df = pd.DataFrame(data=[4, 5, 6, 7], index=range(4), columns=['A'])
pd.DataFrame(my_df)

   A
0  4
1  5
2  6
3  7

In [10]:
my_series = pd.Series({'Belgium': 'Brussels', 'India': 'New Delhi', 'United Kingdom': 'London', 'United States': 'Washington'})
pd.DataFrame(my_series)

                         0
Belgium           Brussels
India            New Delhi
United Kingdom      London
United States   Washington

In [11]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6]]))
df.shape

(2, 3)

In [12]:
len(df)

2

In [13]:
df = pd.DataFrame({'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]})
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
df.iloc[0][0]

C:\Users\acer\AppData\Local\Temp\ipykernel_11692\3629555008.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

1

In [15]:
df.loc[0]['A']

1

In [16]:
df.at[0, 'A']

1

In [17]:
df.iat[0, 0]

1

In [18]:
df.iloc[0]

A    1
B    2
C    3
Name: 0, dtype: int64

In [19]:
df.loc[:, 'A']

0    1
1    4
2    7
Name: A, dtype: int64

In [20]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [22]:
df.set_index('C')

   A  B
C
3  1  2
6  4  5
9  7  8

In [23]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])

print(df.loc[2])
df.iloc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

48    7
49    8
50    9
Name: 4, dtype: int32

In [25]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index=[2.5, 12.6, 4.8], columns=[48, 49, 50])
df.loc[2] = [11, 12, 13]
df

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
2.0   11  12  13

In [27]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
df['D'] = df.index
df

   A  B  C  D
0  1  2  3  0
1  4  5  6  1
2  7  8  9  2

In [28]:
df.loc[:, 4] = pd.Series(['5', '6', '7'], index=df.index)
df

   A  B  C  D  4
0  1  2  3  0  5
1  4  5  6  1  6
2  7  8  9  2  7

In [29]:
df_reset = df.reset_index(level=0, drop=True)
df_reset

   A  B  C  D  4
0  1  2  3  0  5
1  4  5  6  1  6
2  7  8  9  2  7

In [30]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [40, 50, 60], [23, 35, 37]]),
                  index=[2.5, 12.6, 4.8, 4.8, 2.5],
                  columns=[48, 49, 50])

df.reset_index().drop_duplicates(subset='index', keep='last').set_index('index')

       48  49  50
index
12.6    4   5   6
4.8    40  50  60
2.5    23  35  37

In [31]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
df.drop('A', axis=1, inplace=True)
df.drop(df.columns[[1]], axis=1)

   B
0  2
1  5
2  8

In [33]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [40, 50, 60], [23, 35, 37]]),
                  index=[2.5, 12.6, 4.8, 4.8, 2.5],
                  columns=[48, 49, 50])

df

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  37

In [34]:
df.drop_duplicates([48], keep='last')

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  37

In [36]:
df

df.drop(df.index[1])

     48  49  50
2.5   1   2   3
4.8   7   8   9
4.8  40  50  60
2.5  23  35  37

In [37]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
newcols = {
    'A': 'new_column_1',
    'B': 'new_column_2',
    'C': 'new_column_3'
}

df.rename(columns=newcols, inplace=True)
df.rename(index={1: 'a'})

   new_column_1  new_column_2  new_column_3
0             1             2             3
a             4             5             6
2             7             8             9